{
  "presentation_projects": [
    {
      "id": 1,
      "name": "Bookie",
      "languages": ["HTML", "CSS"],
      "Mission": "L'objectif de ce projet était de développer la page d'accueil d'une plateforme de réservation d'hébergements et d'activités pour la ville de Marseille. En tant que développeur, ma mission principale était d'intégrer une interface web responsive en respectant scrupuleusement les maquettes fournies pour desktop, tablette, et mobile. L'enjeu était de garantir une expérience utilisateur fluide et cohérente, tout en respectant les standards de qualité exigés.",
      "description": "Ce projet consistait en l'intégration d'une interface utilisateur à l'aide de technologies standards, comme HTML et CSS, sans recourir à des frameworks ou des préprocesseurs CSS. Le site devait comporter plusieurs fonctionnalités essentielles, telles qu'un champ de recherche d'hébergements, des cartes cliquables et des filtres de recherche thématiques. Bien que ces fonctionnalités ne soient pas encore opérationnelles dans cette version initiale, l'objectif était de valider l'interface et de s'assurer que tous les éléments respectaient les attentes du client. Le projet a été développé en adoptant une approche desktop-first, suivie de l'ajustement pour les tablettes et les mobiles via l'utilisation de Media Queries. Un accent particulier a été mis sur l'utilisation de balises HTML sémantiques pour garantir une structure claire et compréhensible du code. Le design a été réalisé avec Flexbox, et la police Raleway, fournie via Google Fonts, a été utilisée conformément à la charte graphique.",
      "livraison": "Ce projet a représenté mon premier défi d'intégration responsive à partir d'une maquette complète. J'ai rencontré de nombreuses difficultés, notamment en ce qui concerne l'adaptation du design pour différents appareils et la gestion des détails visuels pour rester fidèle à la maquette. Cependant, après 138 commits et de nombreux ajustements, j'ai pu livrer une version conforme aux attentes du client. Le livrable final est une page d'accueil responsive, fonctionnelle et fidèle aux maquettes, optimisée pour des résolutions allant de 320 px à 1440 px. Le projet a été testé et validé sur les dernières versions de Google Chrome et Mozilla Firefox, avec un code propre et conforme aux standards W3C. Ce projet a marqué une étape importante dans ma carrière en tant que développeur web, en consolidant mes compétences en intégration et en design responsive.",
      "landscape": "Bookie_landscape.webp",
      "screenshot": "Bookie_screen.webp",
      "link_projet": "https://booki.portfolio.zaaine.com",
      "Link_Git": "https://github.com/zaaine/Booki_projet"
    },
    {
      "id": 2,
      "name": "Oh My Food",
      "languages": ["HTML", "SASS"],
      "Mission": "OhMyFood est une startup en pleine expansion dans le secteur de la restauration. Ma mission était de concevoir et de développer une plateforme 'mobile first' permettant aux utilisateurs de consulter les menus gastronomiques de divers restaurants parisiens. Le projet visait à réduire le temps d'attente des clients en leur offrant la possibilité de composer leur repas en ligne, afin que les plats soient prêts à leur arrivée. Mon travail consistait à transformer les maquettes en une interface fonctionnelle, responsive et intuitive.",
      "description": "Le projet OhMyFood reposait sur l'intégration d'une interface mobile-first, ce qui impliquait une rigueur particulière dans l'adaptation du site pour les différentes tailles d'écrans (mobile, tablette, desktop). Les maquettes fournies par l'UX designer, ainsi que les prototypes disponibles sur Figma, ont servi de référence pour l'implémentation des différentes fonctionnalités et animations. J'ai eu beaucoup de plaisir à imaginer et à créer des animations fonctionnelles, rendant le site particulièrement agréable et attrayant. Parmi celles-ci, la sélection des plats et la validation des commandes, qui apportent une dimension interactive et ludique à l'expérience utilisateur. Ces animations ont été entièrement conçues sans recours à aucun framework, uniquement avec du CSS et Sass. Le site intègre donc ces animations CSS interactives visant à améliorer l'expérience utilisateur en rendant la navigation plus fluide et engageante. L'utilisation de Sass a permis d'optimiser l'organisation du code CSS, rendant celui-ci plus maintenable et modulaire. De plus, tout le processus de développement a été soigneusement versionné à l'aide de Git et GitHub, garantissant un suivi optimal du projet.",
      "livraison": "Le livrable final est un site web responsive, développé selon une approche 'mobile first' et conforme aux maquettes et prototypes fournis. La plateforme permet aux utilisateurs de consulter les menus de 4 restaurants et d'interagir avec les différentes options de repas. Grâce à l'utilisation de Sass et aux animations CSS implémentées, l'interface est à la fois esthétiquement agréable et performante. Ce projet a marqué une étape importante dans ma carrière, car il m'a permis d'améliorer mes compétences en intégration d'interfaces complexes, en gestion de versions avec Git, ainsi qu'en utilisation avancée de Sass et des animations CSS. J'ai particulièrement apprécié la liberté créative pour concevoir des animations sans framework, ce qui a renforcé ma capacité à offrir une expérience utilisateur riche et immersive.",
      "landscape": "OhMyFood_landscape.webp",
      "screenshot": "OhMyFood_screen.webp",
      "link_projet": "https://ohmyfood.portfolio.zaaine.com",
      "Link_Git": "https://github.com/zaaine/Ohmyfood-zaaine"
    },
    {
      "id": 3,
      "name": "Kasa",
      "languages": ["React", "SASS"],
      "Mission": "Kasa est une entreprise leader dans la location d'appartements entre particuliers. Ma mission en tant que développeur front-end freelance était de contribuer à la refonte totale de leur application, en utilisant une stack JavaScript moderne. Le projet portait principalement sur l'intégration front-end avec React, React Router, et Sass, afin de moderniser le site en le rendant plus fluide, performant et intuitif pour les utilisateurs.",
      "description": "Le projet Kasa a été réalisé à partir de zéro. Je me suis appuyé sur une maquette initiale non définitive, ce qui m'a permis d'apporter des améliorations au fur et à mesure du développement. Le site a été conçu pour être entièrement responsive, avec une adaptation parfaite pour les différents appareils (mobile, tablette, desktop). J'ai également développé un carrousel pour la galerie d'images, offrant une navigation intuitive et fluide. L'intégration a été réalisée en utilisant React et React Router pour gérer la navigation entre les différentes pages et les paramètres d'URL. Le site a été structuré en composants réutilisables, avec une gestion des états et des props pour assurer une interaction optimale. Sass a été utilisé pour gérer et organiser le CSS de manière modulaire et maintenable, garantissant une structure claire et performante du code. En l'absence du back-end, les données ont été simulées via un fichier JSON pour permettre l'affichage des dernières annonces de logements. La gestion des routes a été implémentée pour afficher une page 404 lorsque des URL incorrectes sont saisies.",
      "livraison": "Le livrable final est une application web responsive, développée avec React, React Router, et Sass. Le site est conçu pour offrir une navigation fluide entre les pages, avec une interface réactive et esthétique. Le carrousel de la galerie d'images, ainsi que les différentes fonctionnalités du site, ont été réalisés sans l'utilisation de librairies externes, garantissant ainsi un contrôle total sur le code. Ce projet était mon premier développé avec React, et j'ai particulièrement apprécié travailler avec ce langage, qui est désormais celui que je préfère. Il m'a permis de renforcer mes compétences en React et React Router, notamment dans la gestion des routes et des paramètres d'URL, ainsi que dans la création de composants réutilisables et maintenables.",
      "landscape": "Kasa_landscape.webp",
      "screenshot": "Kasa_screen.webp",
      "link_projet": "https://kasa.portfolio.zaaine.com",
      "Link_Git": "https://github.com/zaaine/Kasa_FR"
    },
    {
      "id": 4,
      "name": "ArgentBank",
      "languages": ["HTML", "CSS", "React", "API network"],
      "Mission": "ArgentBank est une nouvelle banque en ligne souhaitant proposer une expérience utilisateur moderne et sécurisée pour la gestion des finances personnelles. Ma mission en tant que développeur front-end freelance était de développer une application web complète et responsive en utilisant React et Redux pour gérer l'état global de l'application. Le projet a été réalisé en collaboration avec une équipe back-end, avec des interactions entre le front-end et le back-end via des appels API REST documentés avec Swagger.",
      "description": "Le projet ArgentBank a été divisé en plusieurs phases. La première phase consistait à implémenter un système d'authentification complet, permettant aux utilisateurs de se connecter, de visualiser et de gérer leurs informations personnelles via un tableau de bord sécurisé. J'ai utilisé React pour développer l'interface utilisateur et Redux pour gérer le state global de l'application. Cette approche a permis une gestion cohérente des données à travers l'ensemble des composants. La deuxième phase s'est concentrée sur la gestion des transactions. L'objectif était de permettre aux utilisateurs de visualiser leurs transactions bancaires mensuelles, d'accéder aux détails de chaque transaction et de modifier les informations associées. J'ai également travaillé sur la modélisation des routes API pour les transactions, en suivant les directives de Swagger. Cela incluait la définition des endpoints, des méthodes HTTP (GET, POST, etc.), et la description des réponses possibles pour chaque route, garantissant ainsi une documentation claire et maintenable.",
      "livraison": "Le livrable final est une application bancaire sécurisée et responsive, développée avec React et Redux. Le tableau de bord permet aux utilisateurs de se connecter, de consulter leurs informations personnelles, et de gérer leurs transactions bancaires de manière fluide. L'intégration des routes API a été documentée avec Swagger, garantissant une communication claire entre le front-end et le back-end. Ce projet React m'a permis de franchir le pallier de développeur React confirmé. J'ai su implémenter la logique Redux de manière fonctionnelle, tout en la rendant adaptable pour des phases de développement plus complexes à venir. La proposition d'une documentation Swagger a également été une expérience enrichissante, apportant une structure claire pour les futures interactions entre le front-end et le back-end.",
      "landscape": "ArgentBank_landscape.webp",
      "screenshot": "ArgentBank_screen.webp",
      "link_projet": "",
      "Link_Git": "https://github.com/zaaine/ArgentBank-website"
    },
    {
      "id": 5,
      "name": "Ninna Carducci",
      "languages": ["HTML", "CSS"],
      "Mission": "Ma mission principale était d'améliorer le référencement SEO du site web de Ninna Carducci, une photographe freelance. L'objectif était d'augmenter la visibilité en ligne du site pour attirer davantage de clients potentiels et améliorer le classement dans les moteurs de recherche.",
      "description": "Le projet consistait à optimiser le site web de Ninna Carducci en améliorant sa structure HTML, en optimisant les balises méta, et en intégrant des mots-clés pertinents liés à la photographie freelance. J'ai également travaillé sur l'optimisation des temps de chargement des pages et assuré que le site soit responsive et accessible. L'analyse des performances SEO a été réalisée à l'aide d'outils comme Google Analytics et Google Search Console pour identifier les points d'amélioration et suivre les progrès réalisés.",
      "livraison": "Le livrable final est un site web optimisé pour le SEO, avec une meilleure visibilité sur les moteurs de recherche. Les modifications apportées ont conduit à une augmentation du trafic organique et à un meilleur classement pour les mots-clés ciblés. Le site est désormais plus rapide, plus accessible, et mieux structuré, ce qui améliore l'expérience utilisateur et facilite l'acquisition de nouveaux clients pour Ninna Carducci.",
      "landscape": "ninnaCarducci_landscape.webp",
      "screenshot": "ninnaCarducci_screen.webp",
      "link_projet": "https://ninnacarducci.portfolio.zaaine.com",
      "Link_Git": "https://github.com/zaaine/NinaCarducci---Photographe.git"
    },
    {
      "id": 6,
      "name": "Yummy Nouilles",
      "languages": ["HTML", "SASS"],
      "Mission": "Développer une plateforme de commande en ligne pour la chaîne de restaurants Yummy Nouilles et promouvoir leur présence en ligne afin d'augmenter les ventes et la notoriété de la marque.",
      "description": "Le projet Yummy Nouilles impliquait la création d'un site web responsive permettant aux clients de passer des commandes en ligne facilement. J'ai intégré des fonctionnalités telles que le menu interactif, le panier d'achat, et le système de paiement sécurisé. En utilisant HTML et SASS, j'ai conçu une interface attrayante et intuitive, tout en assurant la compatibilité avec différents appareils. De plus, j'ai mis en place des stratégies de promotion en ligne, incluant l'optimisation SEO et l'intégration des réseaux sociaux pour attirer davantage de clients.",
      "livraison": "Le site web finalisé permet aux clients de commander leurs plats préférés de Yummy Nouilles en quelques clics, améliorant ainsi l'expérience utilisateur et augmentant les ventes en ligne. Le design responsive assure une navigation fluide sur tous les appareils, et les fonctionnalités de commande en ligne sécurisées garantissent la confiance des utilisateurs. Les efforts de promotion ont conduit à une augmentation significative du trafic sur le site et à une meilleure visibilité de la marque sur les plateformes en ligne.",
      "landscape": "YummyNouilles_landscape.webp",
      "screenshot": "YummyNouilles_screen.webp",
      "link_projet": "https://yummynouilles.portfolio.zaaine.com",
      "Link_Git": "https://github.com/zaaine/Yummy-Nouilles.git"
    },
    {
      "id": 7,
      "name": "Sophie Bluel",
      "languages": ["HTML", "CSS", "Javascript", "API network"],
      "Mission": "Créer une page web dynamique pour Sophie Bluel, une architecte, permettant la publication et la gestion de ses travaux. L'objectif était de fournir une plateforme interactive où elle pourrait présenter ses projets de manière moderne et engageante.",
      "description": "Le projet Sophie Bluel consistait en la conception et le développement d'un site web dynamique utilisant HTML, CSS, et Javascript. J'ai implémenté des fonctionnalités interactives telles qu'une galerie de projets filtrable, des animations au défilement, et une section de contact intégrée avec une API de messagerie. L'utilisation d'APIs réseau a permis d'intégrer des fonctionnalités avancées comme la récupération des données des projets depuis une base de données externe, assurant ainsi une gestion efficace et évolutive des contenus.",
      "livraison": "Le site web final offre une expérience utilisateur fluide et interactive, permettant à Sophie Bluel de présenter ses travaux de manière professionnelle et attrayante. Les fonctionnalités dynamiques facilitent la mise à jour des projets et améliorent l'engagement des visiteurs. Le site est entièrement responsive, garantissant une accessibilité optimale sur tous les types d'appareils. Grâce à l'intégration des APIs, le site est scalable et peut être facilement étendu avec de nouvelles fonctionnalités à l'avenir.",
      "landscape": "sophieBluel_landscape.webp",
      "screenshot": "sophieBluel_screen.webp",
      "link_projet": "",
      "Link_Git": "https://github.com/zaaine/Portfolio-architecte-sophie-bluel.git"
    },
    {
      "id": 8,
      "name": "Riding Cities",
      "languages": ["HTML", "CSS"],
      "Mission": "Mettre à jour et moderniser le site web de l'association sportive Riding Cities, qui promeut le skate, afin d'améliorer sa présence en ligne et d'attirer davantage de membres et de participants aux événements.",
      "description": "Le projet Riding Cities impliquait la refonte complète du site web de l'association, en utilisant HTML et CSS pour créer une interface moderne et attrayante. J'ai amélioré la structure du site pour une meilleure navigation, optimisé le design pour la responsivité sur différents appareils, et intégré des sections dédiées aux événements, aux actualités, et aux membres. L'objectif était de rendre le site plus convivial et informatif, tout en reflétant l'esprit dynamique de l'association.",
      "livraison": "Le site web finalisé offre une interface moderne et intuitive, facilitant la navigation pour les utilisateurs. Les sections dédiées aux événements et aux actualités permettent une communication efficace des activités de l'association, tandis que la responsivité assure une expérience utilisateur optimale sur tous les appareils. Les améliorations apportées ont contribué à une augmentation de l'engagement des membres et à une meilleure visibilité de Riding Cities dans la communauté du skate.",
      "landscape": "ridingCities_landscape.webp",
      "screenshot": "ridingCities_screen.webp",
      "link_projet": "https://ridingcities.portfolio.zaaine.com",
      "Link_Git": "https://github.com/zaaine/Yummy-Nouilles.git"
    },

    {
      "id": 9,
      "name": "Print IT",
      "languages": ["HTML", "CSS", "Javascript"],
      "Mission": "Développer un carrousel dynamique pour le site existant Print IT et optimiser le référencement SEO afin d'améliorer la visibilité et l'interaction utilisateur.",
      "description": "Le projet Print IT consistait en la création d'un carrousel interactif permettant aux utilisateurs de naviguer facilement à travers différentes offres et services proposés par l'entreprise. En utilisant HTML, CSS et Javascript, j'ai conçu une interface intuitive et réactive, intégrant des animations fluides pour une meilleure expérience utilisateur. Parallèlement, j'ai entrepris une refonte SEO complète, incluant l'optimisation des balises méta, l'amélioration de la structure du contenu, et l'implémentation de techniques de référencement avancées pour augmenter le classement du site sur les moteurs de recherche.",
      "livraison": "Le livrable final comprend un carrousel dynamique entièrement fonctionnel, intégré de manière transparente au site existant de Print IT. Les améliorations SEO ont conduit à une augmentation notable du trafic organique et à une meilleure visibilité en ligne. Le carrousel a été optimisé pour une performance maximale sur tous les appareils, garantissant une navigation fluide et engageante. Les tests effectués ont confirmé l'efficacité des optimisations SEO, avec des résultats positifs sur les classements des moteurs de recherche et l'engagement des utilisateurs.",
      "landscape": "printIt_landscape.webp",
      "screenshot": "printIt_screen.webp",
      "link_projet": "https://printit.portfolio.zaaine.com",
      "Link_Git": "https://github.com/zaaine/Print.IT-JS_zaaine.git"
    },
    {
      "id": 10,
      "name": "724 Events",
      "languages": ["React", "React Testing Library"],
      "Mission": "Déboguer et améliorer la fiabilité du site événementiel 724 Events en réalisant des tests unitaires et end-to-end pour assurer une expérience utilisateur sans faille. Rédiger un livre de recette à presenter aux clients expliquant la demarche de résolution.",
      "description": "Le projet 724 Events portait sur le débogage approfondi d'un site web événementiel. En utilisant React et la React Testing Library, j'ai mis en place une suite complète de tests unitaires et end-to-end pour identifier et corriger les bugs existants. Cette démarche a permis de renforcer la stabilité du site, d'améliorer les performances et de garantir que toutes les fonctionnalités fonctionnent comme prévu. J'ai également optimisé le code existant pour une meilleure maintenabilité et évolutivité, tout en assurant une couverture de tests élevée pour prévenir les régressions futures.",
      "livraison": "Le site 724 Events a été stabilisé grâce à l'identification et à la correction des principaux bugs, améliorant ainsi l'expérience utilisateur globale. La mise en place de tests unitaires et end-to-end a permis de garantir la fiabilité des fonctionnalités critiques, réduisant significativement le risque de dysfonctionnements. De plus, l'optimisation du code a rendu le site plus performant et plus facile à maintenir, facilitant ainsi les futures mises à jour et extensions. Les tests automatisés ont également accéléré le processus de développement en permettant des déploiements plus sûrs et plus fréquents.",
      "landscape": "724events_landscape.webp",
      "screenshot": "724events_screen.webp",
      "link_projet": "",
      "Link_Git": "https://github.com/zaaine/724Events.git"
    }
  ]
}
